; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x8-y8-t4-k4444-l4444-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f f7-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f f7-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f f7-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f f7-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f f7-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f f7-5f 
        f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f f7-6f 
        f0-7f f1-7f f2-7f f3-7f f4-7f f5-7f f6-7f f7-7f 
        shape0 shape1 shape2 shape3 
        key0-0 key0-1 key0-2 key0-3 
        key1-0 key1-1 key1-2 key1-3 
        key2-0 key2-1 key2-2 key2-3 
        key3-0 key3-1 key3-2 key3-3 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f6-0f)
(place f7-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f6-1f)
(place f7-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f6-2f)
(place f7-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f6-3f)
(place f7-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f6-4f)
(place f7-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(place f6-5f)
(place f7-5f)
(place f0-6f)
(place f1-6f)
(place f2-6f)
(place f3-6f)
(place f4-6f)
(place f5-6f)
(place f6-6f)
(place f7-6f)
(place f0-7f)
(place f1-7f)
(place f2-7f)
(place f3-7f)
(place f4-7f)
(place f5-7f)
(place f6-7f)
(place f7-7f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key0-3)
(key-shape key0-3 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key1-3)
(key-shape key1-3 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(key key2-3)
(key-shape key2-3 shape2)
(key key3-0)
(key-shape key3-0 shape3)
(key key3-1)
(key-shape key3-1 shape3)
(key key3-2)
(key-shape key3-2 shape3)
(key key3-3)
(key-shape key3-3 shape3)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f5-0f f6-0f)
(conn f6-0f f7-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f5-1f f6-1f)
(conn f6-1f f7-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f5-2f f6-2f)
(conn f6-2f f7-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f5-3f f6-3f)
(conn f6-3f f7-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f5-4f f6-4f)
(conn f6-4f f7-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f5-5f f6-5f)
(conn f6-5f f7-5f)
(conn f0-6f f1-6f)
(conn f1-6f f2-6f)
(conn f2-6f f3-6f)
(conn f3-6f f4-6f)
(conn f4-6f f5-6f)
(conn f5-6f f6-6f)
(conn f6-6f f7-6f)
(conn f0-7f f1-7f)
(conn f1-7f f2-7f)
(conn f2-7f f3-7f)
(conn f3-7f f4-7f)
(conn f4-7f f5-7f)
(conn f5-7f f6-7f)
(conn f6-7f f7-7f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f6-0f f6-1f)
(conn f7-0f f7-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f6-1f f6-2f)
(conn f7-1f f7-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f6-2f f6-3f)
(conn f7-2f f7-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f6-3f f6-4f)
(conn f7-3f f7-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f6-4f f6-5f)
(conn f7-4f f7-5f)
(conn f0-5f f0-6f)
(conn f1-5f f1-6f)
(conn f2-5f f2-6f)
(conn f3-5f f3-6f)
(conn f4-5f f4-6f)
(conn f5-5f f5-6f)
(conn f6-5f f6-6f)
(conn f7-5f f7-6f)
(conn f0-6f f0-7f)
(conn f1-6f f1-7f)
(conn f2-6f f2-7f)
(conn f3-6f f3-7f)
(conn f4-6f f4-7f)
(conn f5-6f f5-7f)
(conn f6-6f f6-7f)
(conn f7-6f f7-7f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f6-0f f5-0f)
(conn f7-0f f6-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f6-1f f5-1f)
(conn f7-1f f6-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f6-2f f5-2f)
(conn f7-2f f6-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f6-3f f5-3f)
(conn f7-3f f6-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f6-4f f5-4f)
(conn f7-4f f6-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f6-5f f5-5f)
(conn f7-5f f6-5f)
(conn f1-6f f0-6f)
(conn f2-6f f1-6f)
(conn f3-6f f2-6f)
(conn f4-6f f3-6f)
(conn f5-6f f4-6f)
(conn f6-6f f5-6f)
(conn f7-6f f6-6f)
(conn f1-7f f0-7f)
(conn f2-7f f1-7f)
(conn f3-7f f2-7f)
(conn f4-7f f3-7f)
(conn f5-7f f4-7f)
(conn f6-7f f5-7f)
(conn f7-7f f6-7f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f6-1f f6-0f)
(conn f7-1f f7-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f6-2f f6-1f)
(conn f7-2f f7-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f6-3f f6-2f)
(conn f7-3f f7-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f6-4f f6-3f)
(conn f7-4f f7-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(conn f6-5f f6-4f)
(conn f7-5f f7-4f)
(conn f0-6f f0-5f)
(conn f1-6f f1-5f)
(conn f2-6f f2-5f)
(conn f3-6f f3-5f)
(conn f4-6f f4-5f)
(conn f5-6f f5-5f)
(conn f6-6f f6-5f)
(conn f7-6f f7-5f)
(conn f0-7f f0-6f)
(conn f1-7f f1-6f)
(conn f2-7f f2-6f)
(conn f3-7f f3-6f)
(conn f4-7f f4-6f)
(conn f5-7f f5-6f)
(conn f6-7f f6-6f)
(conn f7-7f f7-6f)
(open f1-0f)
(open f2-0f)
(open f3-0f)
(open f4-0f)
(open f6-0f)
(open f7-0f)
(open f0-1f)
(open f1-1f)
(open f3-1f)
(open f4-1f)
(open f5-1f)
(open f6-1f)
(open f7-1f)
(open f0-2f)
(open f1-2f)
(open f2-2f)
(open f4-2f)
(open f5-2f)
(open f6-2f)
(open f1-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f5-3f)
(open f7-3f)
(open f0-4f)
(open f3-4f)
(open f4-4f)
(open f5-4f)
(open f6-4f)
(open f7-4f)
(open f0-5f)
(open f1-5f)
(open f4-5f)
(open f6-5f)
(open f0-6f)
(open f1-6f)
(open f2-6f)
(open f3-6f)
(open f5-6f)
(open f6-6f)
(open f7-6f)
(open f0-7f)
(open f1-7f)
(open f2-7f)
(open f3-7f)
(open f6-7f)
(open f7-7f)
(locked f3-2f)
(lock-shape f3-2f shape0)
(locked f5-7f)
(lock-shape f5-7f shape0)
(locked f2-5f)
(lock-shape f2-5f shape0)
(locked f4-6f)
(lock-shape f4-6f shape0)
(locked f2-4f)
(lock-shape f2-4f shape1)
(locked f0-3f)
(lock-shape f0-3f shape1)
(locked f2-1f)
(lock-shape f2-1f shape1)
(locked f1-4f)
(lock-shape f1-4f shape1)
(locked f6-3f)
(lock-shape f6-3f shape2)
(locked f5-0f)
(lock-shape f5-0f shape2)
(locked f3-5f)
(lock-shape f3-5f shape2)
(locked f7-2f)
(lock-shape f7-2f shape2)
(locked f4-7f)
(lock-shape f4-7f shape3)
(locked f5-5f)
(lock-shape f5-5f shape3)
(locked f0-0f)
(lock-shape f0-0f shape3)
(locked f7-5f)
(lock-shape f7-5f shape3)
(at key0-0 f7-2f)
(at key0-1 f2-3f)
(at key0-2 f0-4f)
(at key0-3 f7-1f)
(at key1-0 f7-1f)
(at key1-1 f2-5f)
(at key1-2 f0-3f)
(at key1-3 f1-7f)
(at key2-0 f7-6f)
(at key2-1 f7-2f)
(at key2-2 f3-6f)
(at key2-3 f5-0f)
(at key3-0 f5-2f)
(at key3-1 f5-5f)
(at key3-2 f2-4f)
(at key3-3 f2-1f)
(at-robot f2-7f)
)
(:goal
(and
(at key0-2 f7-1f)
(at key0-3 f0-1f)
(at key1-3 f6-7f)
(at key2-0 f5-5f)
(at key2-2 f1-2f)
(at key3-3 f5-0f)
)
)
)

; plan
1. (move f2-7f f2-6f)
   deleted: (at-robot f2-7f)
   added: (at-robot f2-6f)
   goals met: 0 of 6
2. (move f2-6f f3-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f3-6f)
   goals met: 0 of 6
3. (pickup f3-6f key2-2)
   deleted: (at key2-2 f3-6f) (arm-empty)
   added: (holding key2-2)
   goals met: 0 of 6
4. (unlock f3-6f f3-5f key2-2 shape2)
   deleted: (locked f3-5f)
   added: (open f3-5f)
   goals met: 0 of 6
5. (move f3-6f f3-5f)
   deleted: (at-robot f3-6f)
   added: (at-robot f3-5f)
   goals met: 0 of 6
6. (move f3-5f f4-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f4-5f)
   goals met: 0 of 6
7. (move f4-5f f4-4f)
   deleted: (at-robot f4-5f)
   added: (at-robot f4-4f)
   goals met: 0 of 6
8. (move f4-4f f5-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f5-4f)
   goals met: 0 of 6
9. (move f5-4f f5-3f)
   deleted: (at-robot f5-4f)
   added: (at-robot f5-3f)
   goals met: 0 of 6
10. (move f5-3f f5-2f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-2f)
   goals met: 0 of 6
11. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 0 of 6
12. (unlock f5-1f f5-0f key2-2 shape2)
   deleted: (locked f5-0f)
   added: (open f5-0f)
   goals met: 0 of 6
13. (move f5-1f f5-2f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-2f)
   goals met: 0 of 6
14. (pickup-and-loose f5-2f key3-0 key2-2)
   deleted: (holding key2-2) (at key3-0 f5-2f)
   added: (holding key3-0) (at key2-2 f5-2f)
   goals met: 0 of 6
15. (move f5-2f f5-3f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-3f)
   goals met: 0 of 6
16. (move f5-3f f5-4f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-4f)
   goals met: 0 of 6
17. (unlock f5-4f f5-5f key3-0 shape3)
   deleted: (locked f5-5f)
   added: (open f5-5f)
   goals met: 0 of 6
18. (move f5-4f f5-3f)
   deleted: (at-robot f5-4f)
   added: (at-robot f5-3f)
   goals met: 0 of 6
19. (move f5-3f f5-2f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-2f)
   goals met: 0 of 6
20. (pickup-and-loose f5-2f key2-2 key3-0)
   deleted: (holding key3-0) (at key2-2 f5-2f)
   added: (holding key2-2) (at key3-0 f5-2f)
   goals met: 0 of 6
21. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 0 of 6
22. (move f5-1f f5-0f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-0f)
   goals met: 0 of 6
23. (move f5-0f f4-0f)
   deleted: (at-robot f5-0f)
   added: (at-robot f4-0f)
   goals met: 0 of 6
24. (move f4-0f f3-0f)
   deleted: (at-robot f4-0f)
   added: (at-robot f3-0f)
   goals met: 0 of 6
25. (move f3-0f f2-0f)
   deleted: (at-robot f3-0f)
   added: (at-robot f2-0f)
   goals met: 0 of 6
26. (move f2-0f f1-0f)
   deleted: (at-robot f2-0f)
   added: (at-robot f1-0f)
   goals met: 0 of 6
27. (move f1-0f f1-1f)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 0 of 6
28. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 6
29. (putdown f1-2f key2-2)
   deleted: (holding key2-2)
   added: (arm-empty) (at key2-2 f1-2f)
   goals met: 1 of 6
30. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 1 of 6
31. (move f1-1f f1-0f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-0f)
   goals met: 1 of 6
32. (move f1-0f f2-0f)
   deleted: (at-robot f1-0f)
   added: (at-robot f2-0f)
   goals met: 1 of 6
33. (move f2-0f f3-0f)
   deleted: (at-robot f2-0f)
   added: (at-robot f3-0f)
   goals met: 1 of 6
34. (move f3-0f f4-0f)
   deleted: (at-robot f3-0f)
   added: (at-robot f4-0f)
   goals met: 1 of 6
35. (move f4-0f f5-0f)
   deleted: (at-robot f4-0f)
   added: (at-robot f5-0f)
   goals met: 1 of 6
36. (move f5-0f f6-0f)
   deleted: (at-robot f5-0f)
   added: (at-robot f6-0f)
   goals met: 1 of 6
37. (move f6-0f f7-0f)
   deleted: (at-robot f6-0f)
   added: (at-robot f7-0f)
   goals met: 1 of 6
38. (move f7-0f f7-1f)
   deleted: (at-robot f7-0f)
   added: (at-robot f7-1f)
   goals met: 1 of 6
39. (pickup f7-1f key1-0)
   deleted: (at key1-0 f7-1f) (arm-empty)
   added: (holding key1-0)
   goals met: 1 of 6
40. (move f7-1f f6-1f)
   deleted: (at-robot f7-1f)
   added: (at-robot f6-1f)
   goals met: 1 of 6
41. (move f6-1f f5-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f5-1f)
   goals met: 1 of 6
42. (move f5-1f f4-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f4-1f)
   goals met: 1 of 6
43. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 1 of 6
44. (unlock f3-1f f2-1f key1-0 shape1)
   deleted: (locked f2-1f)
   added: (open f2-1f)
   goals met: 1 of 6
45. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 1 of 6
46. (move f4-1f f5-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f5-1f)
   goals met: 1 of 6
47. (move f5-1f f6-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f6-1f)
   goals met: 1 of 6
48. (move f6-1f f7-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f7-1f)
   goals met: 1 of 6
49. (pickup-and-loose f7-1f key0-3 key1-0)
   deleted: (holding key1-0) (at key0-3 f7-1f)
   added: (holding key0-3) (at key1-0 f7-1f)
   goals met: 1 of 6
50. (move f7-1f f6-1f)
   deleted: (at-robot f7-1f)
   added: (at-robot f6-1f)
   goals met: 1 of 6
51. (move f6-1f f5-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f5-1f)
   goals met: 1 of 6
52. (move f5-1f f4-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f4-1f)
   goals met: 1 of 6
53. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 1 of 6
54. (unlock f3-1f f3-2f key0-3 shape0)
   deleted: (locked f3-2f)
   added: (open f3-2f)
   goals met: 1 of 6
55. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 1 of 6
56. (move f2-1f f1-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 1 of 6
57. (move f1-1f f0-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f0-1f)
   goals met: 1 of 6
58. (putdown f0-1f key0-3)
   deleted: (holding key0-3)
   added: (arm-empty) (at key0-3 f0-1f)
   goals met: 2 of 6
59. (move f0-1f f1-1f)
   deleted: (at-robot f0-1f)
   added: (at-robot f1-1f)
   goals met: 2 of 6
60. (move f1-1f f2-1f)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 2 of 6
61. (pickup f2-1f key3-3)
   deleted: (at key3-3 f2-1f) (arm-empty)
   added: (holding key3-3)
   goals met: 2 of 6
62. (move f2-1f f3-1f)
   deleted: (at-robot f2-1f)
   added: (at-robot f3-1f)
   goals met: 2 of 6
63. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 2 of 6
64. (move f4-1f f5-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f5-1f)
   goals met: 2 of 6
65. (move f5-1f f5-0f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-0f)
   goals met: 2 of 6
66. (putdown f5-0f key3-3)
   deleted: (holding key3-3)
   added: (arm-empty) (at key3-3 f5-0f)
   goals met: 3 of 6
67. (move f5-0f f5-1f)
   deleted: (at-robot f5-0f)
   added: (at-robot f5-1f)
   goals met: 3 of 6
68. (move f5-1f f5-2f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-2f)
   goals met: 3 of 6
69. (move f5-2f f5-3f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-3f)
   goals met: 3 of 6
70. (move f5-3f f5-4f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-4f)
   goals met: 3 of 6
71. (move f5-4f f5-5f)
   deleted: (at-robot f5-4f)
   added: (at-robot f5-5f)
   goals met: 3 of 6
72. (move f5-5f f6-5f)
   deleted: (at-robot f5-5f)
   added: (at-robot f6-5f)
   goals met: 3 of 6
73. (move f6-5f f6-6f)
   deleted: (at-robot f6-5f)
   added: (at-robot f6-6f)
   goals met: 3 of 6
74. (move f6-6f f7-6f)
   deleted: (at-robot f6-6f)
   added: (at-robot f7-6f)
   goals met: 3 of 6
75. (pickup f7-6f key2-0)
   deleted: (at key2-0 f7-6f) (arm-empty)
   added: (holding key2-0)
   goals met: 3 of 6
76. (move f7-6f f6-6f)
   deleted: (at-robot f7-6f)
   added: (at-robot f6-6f)
   goals met: 3 of 6
77. (move f6-6f f6-5f)
   deleted: (at-robot f6-6f)
   added: (at-robot f6-5f)
   goals met: 3 of 6
78. (move f6-5f f5-5f)
   deleted: (at-robot f6-5f)
   added: (at-robot f5-5f)
   goals met: 3 of 6
79. (putdown f5-5f key2-0)
   deleted: (holding key2-0)
   added: (arm-empty) (at key2-0 f5-5f)
   goals met: 4 of 6
80. (move f5-5f f4-5f)
   deleted: (at-robot f5-5f)
   added: (at-robot f4-5f)
   goals met: 4 of 6
81. (move f4-5f f3-5f)
   deleted: (at-robot f4-5f)
   added: (at-robot f3-5f)
   goals met: 4 of 6
82. (move f3-5f f3-6f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-6f)
   goals met: 4 of 6
83. (move f3-6f f2-6f)
   deleted: (at-robot f3-6f)
   added: (at-robot f2-6f)
   goals met: 4 of 6
84. (move f2-6f f1-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f1-6f)
   goals met: 4 of 6
85. (move f1-6f f1-7f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-7f)
   goals met: 4 of 6
86. (pickup f1-7f key1-3)
   deleted: (at key1-3 f1-7f) (arm-empty)
   added: (holding key1-3)
   goals met: 4 of 6
87. (move f1-7f f1-6f)
   deleted: (at-robot f1-7f)
   added: (at-robot f1-6f)
   goals met: 4 of 6
88. (move f1-6f f2-6f)
   deleted: (at-robot f1-6f)
   added: (at-robot f2-6f)
   goals met: 4 of 6
89. (move f2-6f f3-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f3-6f)
   goals met: 4 of 6
90. (move f3-6f f3-5f)
   deleted: (at-robot f3-6f)
   added: (at-robot f3-5f)
   goals met: 4 of 6
91. (move f3-5f f4-5f)
   deleted: (at-robot f3-5f)
   added: (at-robot f4-5f)
   goals met: 4 of 6
92. (move f4-5f f5-5f)
   deleted: (at-robot f4-5f)
   added: (at-robot f5-5f)
   goals met: 4 of 6
93. (move f5-5f f6-5f)
   deleted: (at-robot f5-5f)
   added: (at-robot f6-5f)
   goals met: 4 of 6
94. (move f6-5f f6-6f)
   deleted: (at-robot f6-5f)
   added: (at-robot f6-6f)
   goals met: 4 of 6
95. (move f6-6f f6-7f)
   deleted: (at-robot f6-6f)
   added: (at-robot f6-7f)
   goals met: 4 of 6
96. (putdown f6-7f key1-3)
   deleted: (holding key1-3)
   added: (arm-empty) (at key1-3 f6-7f)
   goals met: 5 of 6
97. (move f6-7f f6-6f)
   deleted: (at-robot f6-7f)
   added: (at-robot f6-6f)
   goals met: 5 of 6
98. (move f6-6f f6-5f)
   deleted: (at-robot f6-6f)
   added: (at-robot f6-5f)
   goals met: 5 of 6
99. (move f6-5f f6-4f)
   deleted: (at-robot f6-5f)
   added: (at-robot f6-4f)
   goals met: 5 of 6
100. (move f6-4f f5-4f)
   deleted: (at-robot f6-4f)
   added: (at-robot f5-4f)
   goals met: 5 of 6
101. (move f5-4f f4-4f)
   deleted: (at-robot f5-4f)
   added: (at-robot f4-4f)
   goals met: 5 of 6
102. (move f4-4f f4-5f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-5f)
   goals met: 5 of 6
103. (move f4-5f f3-5f)
   deleted: (at-robot f4-5f)
   added: (at-robot f3-5f)
   goals met: 5 of 6
104. (move f3-5f f3-6f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-6f)
   goals met: 5 of 6
105. (move f3-6f f2-6f)
   deleted: (at-robot f3-6f)
   added: (at-robot f2-6f)
   goals met: 5 of 6
106. (move f2-6f f1-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f1-6f)
   goals met: 5 of 6
107. (move f1-6f f1-5f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-5f)
   goals met: 5 of 6
108. (move f1-5f f0-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f0-5f)
   goals met: 5 of 6
109. (move f0-5f f0-4f)
   deleted: (at-robot f0-5f)
   added: (at-robot f0-4f)
   goals met: 5 of 6
110. (pickup f0-4f key0-2)
   deleted: (at key0-2 f0-4f) (arm-empty)
   added: (holding key0-2)
   goals met: 5 of 6
111. (move f0-4f f0-5f)
   deleted: (at-robot f0-4f)
   added: (at-robot f0-5f)
   goals met: 5 of 6
112. (move f0-5f f1-5f)
   deleted: (at-robot f0-5f)
   added: (at-robot f1-5f)
   goals met: 5 of 6
113. (unlock f1-5f f2-5f key0-2 shape0)
   deleted: (locked f2-5f)
   added: (open f2-5f)
   goals met: 5 of 6
114. (move f1-5f f2-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 5 of 6
115. (move f2-5f f3-5f)
   deleted: (at-robot f2-5f)
   added: (at-robot f3-5f)
   goals met: 5 of 6
116. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 5 of 6
117. (move f3-4f f4-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f4-4f)
   goals met: 5 of 6
118. (move f4-4f f4-3f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-3f)
   goals met: 5 of 6
119. (move f4-3f f5-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f5-3f)
   goals met: 5 of 6
120. (move f5-3f f5-2f)
   deleted: (at-robot f5-3f)
   added: (at-robot f5-2f)
   goals met: 5 of 6
121. (move f5-2f f6-2f)
   deleted: (at-robot f5-2f)
   added: (at-robot f6-2f)
   goals met: 5 of 6
122. (move f6-2f f6-1f)
   deleted: (at-robot f6-2f)
   added: (at-robot f6-1f)
   goals met: 5 of 6
123. (move f6-1f f7-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f7-1f)
   goals met: 5 of 6
124. (putdown f7-1f key0-2)
   deleted: (holding key0-2)
   added: (arm-empty) (at key0-2 f7-1f)
   goals met: 6 of 6
